app/controllers/posts_controller.rb

  def update

    @post = Post.find(params[:id])
    # @post.update(title: params[:post][:title], description: params[:post][:description])

    @post.update(params[:post])     # quicker way than defining each parameter, e.g. title, descriptions alone
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-09-24 14:34:45.292206"], ["id", 1]]